# Erase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DistributionSysTypeSet..::..Erase Method
DistributionSysTypeSet Class See Also
---
Removes a specified DistributionSys type from the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	DistributionSysType item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As DistributionSysType _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	DistributionSysType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..DistributionSysTypeThe DistributionSys type to be erased.
# ### Return Value
The number of DistributionSys types that were erased from the set.
# See Also
DistributionSysTypeSet Class
Autodesk.Revit.DB.Electrical Namespace